       IDENTIFICATION DIVISION.
       PROGRAM-ID.OPERACOES.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WS-NUMERO1 PIC 9(4) VALUE 0.
       01 WS-NUMERO2 PIC 9(4) VALUE 0.
       01 WS-RESULTADO PIC 9(5) VALUE 0.
       01 WS-TEXTO-ORIGEM PIC X(20) VALUE 'COBOL é PODEROSO !'.
       01 WS-TEXTO-DESTINO PIC X(20).

       PROCEDURE DIVISION.
       INICIO.
       *>COPIAR VALORES
           MOVE 100 TO WS-NUMERO1.
           MOVE WS-NUMERO1 TO WS-NUMERO2.
           MOVE WS-TEXTO-ORIGEM TO WS-TEXTO-DESTINO.

           DISPLAY 'Número 1:' WS-NUMERO1.
           DISPLAY 'Número 2:' WS-NUMERO2.
           DISPLAY 'TEXTO' WS-TEXTO-DESTINO.

           MOVE 'ABC' TO WS-NUMERO1.
           MOVE 123 TO WS-TEXTO-DESTINO.

           STOP RUN.


